import { Wrapper } from '@/styles/globals.styles';

const ConditionsOfUse = () => {
    return (
        <Wrapper>
            <p className="font-bold">ПУБЛІЧНА ОФЕРТА</p>
            <br />
            <p className="font-bold">Преамбула</p>
            <p>
                Шановний Користувач сайту www.bookme.kyiv.ua, звертаємо Вашу
                увагу, що використання в будь-якому вигляді Сайту (в тому числі,
                але не обмежуючись розміщенням Вами Замовлень товарів з
                використанням сайту www.bookme.kyiv.ua, участь в бонусних
                програмах, акціях, заповнення заявок, форм і т.п.) означає, що
                Ви ознайомлені та згодні з умовами використання Сайту
                www.bookme.kyiv.ua, а також є акцептом Вами даної Публічної
                оферти. Дана Публічна оферта є обов&apos;язковою для виконання
                сторонами. У разі Вашої незгоди з умовами даної Публічної
                оферти, Ви повинні утриматися від використання сайту
                www.bookme.kyiv.ua.
            </p>
            <br />
            <p className="font-bold">ВИЗНАЧЕННЯ ТЕРМІНІВ</p>
            <p>
                <br />
                <span className="font-bold">Адміністрація</span> — адміністрація
                інтернет-магазину «BOOKME.KYIV.UA», що розміщено на вeб-сайті
                www.bookme.kyiv.ua, ФОП Науменко Михайло Вікторович,
                зареєстроване в Україні, місцезнаходження за адресою: 02000, м.
                Київ, вул. Щусєва, 23. Акційний контент — контент, що може бути
                доступний для завантаження за акційною ціною протягом певного
                проміжку часу про що буде поінформовано у відповідному розділі
                на сайті.
                <p>
                    <span className="font-bold">Замовлення</span> — належним
                    чином оформлений і розміщений запит Покупця (заповнені
                    відповідні поля на сайті в розділі «Оформлення замовлення»),
                    адресований Продавцю, з пропозицією здійснити продаж
                    обраного на сайті переліку Товару, із зазначенням його
                    кількості.
                </p>
                <p>
                    <span className="font-bold">Користувач</span> — фізична
                    особа, яка досягла 18-річного віку, що володіє повною
                    дієздатністю, що використовує даний сайт і/або його окремі
                    інструменти, яка погодилася з умовами Публічної оферти і
                    виконала всі її умови описані нижче.
                </p>
                <p>
                    <span className="font-bold">Контент</span> — товар, що
                    представлений на сайті www.bookme.kyiv.ua. у вигляді
                    текстових, зображувальних, аудіо та відео файлів, що надані
                    у різних форматах та представлені для огляду, скачування та
                    інших дій Користувачем. Обліковий запис — унікальні облікові
                    та персональні дані Користувача, які ідентифікують
                    Користувача на Сайті, зберігаються на апаратних ресурсах
                    Адміністрації та надають Користувачеві можливість
                    використання функціоналу Сайту, відповідно до умов цієї
                    Угоди.
                </p>
                <p>
                    <span className="font-bold">Одержувач</span> — особа,
                    зазначена Платником у розділі «Оформлення замовлення», в
                    якості особи, що уповноважена отримати товар. Якщо інше не
                    зазначено в розділі «Оформлення замовлення», Одержувачем є
                    Платник. Особистий кабінет — комплекс програмних функцій
                    Сайту, які дозволяють Користувачеві, який авторизувався
                    належним чином в свій Обліковий запис, отримувати інформацію
                    про здійснені ним Замовлення, покупки, вносити зміни в
                    облікові та персональні дані Користувача та отримувати
                    доступ до придбаного Контенту.
                </p>
                <p>
                    <span className="font-bold">Платник</span> — особа, яка
                    здійснює оплату замовлення Покупця, якщо інше не зазначено в
                    розділі «Оформлення замовлення», Платником є Покупець.
                </p>
                <p>
                    <span className="font-bold">Покупець</span> — зареєстрований
                    Користувач, що здійснює замовлення та має намір
                    придбати/купує товари, пропоновані до продажу Продавцем та
                    представлені на сайті www.yakaboo.ua.
                </p>
                <p>
                    <span className="font-bold">Покупець контенту</span> —
                    Покупець, що отримує можливість і здійснює завантаження,
                    пропонованого на сайті www.bookme.kyiv.uа контенту.
                    Правовласник — власник Контенту.
                </p>
                <p>
                    <span className="font-bold">Продавець</span> — юридична
                    особа або фізична особа-підприємець, яка розміщує на сайті
                    інформацію з пропозицією придбати визначені товари.
                    Продавцем може бути як Адміністрація так і будь-яка особа,
                    якій Адміністрація надала право на розміщення відомостей про
                    товар на сайті. Найменування Продавця вказується в
                    документах на передачу товару Покупцеві (акт
                    прийому-передачі, видаткова накладна, товарний чек і т.п.,
                    що підтверджують факт передачі товару Покупцеві).
                </p>
                <p>
                    <span className="font-bold">Пропозиція</span> — відомості
                    про товар, розміщені Продавцем на сайті, які включають в
                    себе інформацію про товар, його ціну, способи оплати та
                    доставки, інформацію про знижки та акційні пропозиції на
                    товар, а також інші умови придбання товару. Умови
                    Пропозицій, розміщених на сайті, встановлюються Продавцем.
                    Пропозиція є інформацією про можливі умови покупки товару.
                </p>
                <span className="font-bold">Сайт</span> — вeб-сайт, що має
                адресу в мережі інтернет www.yakaboo.ua, на окремих сторінках (в
                розділах) якого розміщено правила (умови) реєстрації, оформлення
                замовлення, бонусної програми, оплати, доставки, повернення
                товару, гарантії тощо, а також міститься інформація про Покупця
                (контактні дані, замовлення, адреси доставки, та ін.), за
                допомогою якого Користувач має можливість здійснити покупку
                бажаного товару. Товар — матеріальний об'єкт, пропонований до
                продажу Продавцем, розміщений на сайті, щодо якого вказана ціна,
                назва, опис, характеристики та зазначено статус його
                доступності.
            </p>
            <p>
                <span className="font-bold">Угода</span> — дана публічна оферта,
                включаючи всі її умови та додатки до неї.
            </p>
            <br />
            <p className="font-bold">Загальні положення</p>
            <p>
                1.1. Ця Угода регулює порядок доступу Користувача до інформації,
                що розміщується на Сайті, порядок використання Сайту, а також
                можливість передачі товарів та інші умови.
            </p>
            <p>
                1.2. Сайт є платформою для розміщення пропозицій про продаж
                товарів Продавцем.
            </p>
            <p>
                1.3. Дана угода відповідно до ст. ст. 633, 641 і гл. 63
                Цивільного кодексу України є Публічним договором (офертою) і
                адресовано невизначеному колу осіб не залежно від статусу
                (фізична особа, юридична особа, фізична особа - підприємець), що
                бажають придбати товари, інформація про які міститься на Сайті.
                Оскільки ця Угода є публічною офертою, то отримуючи доступ до
                матеріалів Сайту Користувач\Покупець вважається приєднався до
                цієї Угоди.
            </p>
            <p>
                1.4. Інформація про товар відображається на Сайті і є
                динамічною. Це означає, що інформація може бути оновлена,
                змінена і доповнена Адміністрацією в будь-який момент часу без
                попереднього повідомлення про це Користувача. Визначені зміни
                вступають в силу після їх публікації на Сайті та застосовуються
                до будь-якого замовлення, зробленого після їх публікації.
            </p>
            <p>
                1.5. Інформація про товар Продавця, умови його придбання, ціни
                та будь-яка інша інформація Продавця точно відображається на
                Сайті. Інформація на Сайті про Товар, Контент, Продавця та інші
                умови роботи Сайту та правовідносин між сторонами цієї Угоди
                слугує лише в якості доповнення умов цієї Угоди. У разі
                суперечності інформації на Сайті умовам цієї Угоди, умови Угоди
                мають перевагу та підлягають застосуванню.
            </p>
            <p>
                1.6. Ця Угода може бути укладена фізичною особою, яка досягла
                18-річного віку, що володіє повною дієздатністю, що використовує
                даний сайт і\або його окремі інструменти, яка погодилася з
                умовами Угоди та повністю приймає на себе зобов&apos;язання, що
                виникають в результаті використання Сайту і укладення цієї
                Угоди.
            </p>
            <p>
                1.7. Замовляючи товар на Сайті, Покупець погоджується з усіма
                умовами даної Угоди та її Додатків.
            </p>
            <p>
                1.8. Пропозиція на Сайті не є офертою. Однак, Покупець після
                ознайомлення з Пропозицією вправі зробити оферту Продавцю шляхом
                обрання товару та заповнення форми у розділі «Оформлення
                замовлення». Заповнення визначеної форми вважається офертою
                Покупця Продавцю на придбання відповідного товару на умовах,
                зазначених в Пропозиції.
                {/*Оферту Продавцю вправі зробити і
                незареєстрований Користувач, при цьому він повинен коректно
                ввести всі необхідні дані у форму «Оформлення замовлення» на
                Сайті. */}
            </p>
            <p>
                1.9. Оферта вважається прийнятою Продавцем (акцепт) якщо
                останній здійснив дії, які свідчать про прийняття оферти
                Покупця, а саме: фактично надав доступ та можливість завантажити
                контент через Особистий кабінет Користувача.
            </p>
            <p>
                1.10. Після отримання оферти Покупця Продавець має право
                запропонувати придбати товар на інших умовах, ніж було
                передбачено офертою Покупця. У цьому випадку така пропозиція
                вважається зустрічною офертою і має бути прийнята Покупцем.
                Прийняттям зустрічної оферти вважається фактично оплата,
                отримання Покупцем\Одержувачем товару на умовах, обумовлених
                зустрічною офертою. Продавець має право відкликати таку
                зустрічну оферту до моменту оплати та видачі товару.
            </p>
            <p>
                1.11. У випадку помилковості відправленого акцепту Сторони мають
                право змінити умови тільки у випадку вчасного повідомлення про
                таку помилковість одна одну.
            </p>
            <p>
                1.12. Достатнім доказом прийняття оферти Продавцем або
                зустрічної оферти (тобто узгодження Сторонами всіх істотних умов
                продажу товару) є фактична його оплата, отримання товару
                Покупцем\Одержувачем.
            </p>
            <p>
                1.13. Не вважається прийняттям Продавцем оферти Покупця
                направлення Продавцем\Адміністрацією засобами електротехнічного
                (SMS-інформування, електронна пошта, телефон і т.п.) або іншого
                зв&apos;язку повідомлення Продавця/Адміністрації про одержання
                Замовлення Покупця або про терміни його отримання і/або про ціну
                товару. Дане повідомлення є виключно повідомленням про отримання
                Продавцем оферти Покупця (але не про її прийняття) і містить
                відтворення умов оферти, наданої Покупцем.
            </p>
            <p>
                1.14. Інформація про Товар розміщена безпосередньо на Сайті,
                окрім цього при отриманні товару, до моменту підписання
                документів, що підтверджують отримання товару,
                Покупець/Одержувач зобов&apos;язаний ознайомитися з інформацією
                про товар, що міститься на сайті у картці товару. У разі
                необхідності отримання додаткової інформації про товар
                Покупець/Одержувач зобов&apos;язаний зв&apos;язатися з Продавцем
                та отримати необхідну інформацію засобами дистанційного
                зв&apos;язку до моменту прийняття такого товару.
            </p>
            <p>
                1.15. Знижки/акції не сумуються з іншими знижками/акціями і
                знижками за промокодом.
            </p>
            {/* <p>
                1.16. Знижка за промокодом не застосовується при купівлі
                подарункового сертифіката.
            </p>
            <p>
                1.17. Подарунковим сертифікатом можна оплатити будь-який товар
                на сайті, крім подарункових сертифікатів.
            </p>
            <p>
                1.18. Подарунковий сертифікат можна використати лише один раз.
            </p>
            <p>
                1.19. Термін дії подарункового сертифіката становить 12
                (дванадцять) календарних місяців.
            </p> */}
            {/* <p>
                1.16. Якщо протягом строку дії подарункового сертифіката
                Покупцем не буде реалізоване право на придбання товару, то сума,
                сплачена за сертифікат, поверненню не підлягає.
            </p> */}
            {/* <p>
                1.17. Якщо сума чека перевищує номінал сертифіката – Покупцю
                буде необхідно доплатити різницю, але якщо сума менша за
                номінал, залишок не повертається і подарунковий сертифікат буде
                вважатись використаним.
            </p> */}
            {/* 1.21. Розділити номінал подарункового сертифіката на декілька різних
            чеків неможливо. 1.22. Кількість подарункових сертифікатів для
            оплати покупки необмежена, їх можна підсумувати. 1.23. У разі втрати
            подарунковий сертифікат не підлягає поверненню чи відновленню.
            Подарунковий сертифікат не підлягає обміну на грошові кошти. */}
            <p>
                1.16.Власником прав інтелектуальної власності на поширення
                Контенту, представленого на Сайті, є ФОП Науменко Михайло
                Вікторович, що зареєстрованеий за адресою Україна, 02000, м.
                Київ, вул. Щусєва 23. Використання текстових та фото/відео
                матеріалів Сайту можливо лише з дозволу Адміністрації.
            </p>
            <p>
                1.17. Даний сайт: https://www.bookme.kyiv.ua може
                використовуватись іншими суб&apos;єктами господарювання на
                підставі відповідних договорів оренди та/або надання послуг та
                ін. У свою чергу зазначені суб&apos;єкти господарювання матимуть
                право здійснювати продаж товарів кінцевим споживачам, та
                нестимуть відповідальність по даній продукції перед кінцевими
                споживачами.
                <br />
                <p className="font-bold">
                    Реєстрація на сайті та порядок оформлення Замовлення
                </p>
            </p>
            <p>
                2.1. Для отримання можливості здійснити покупку на сайті
                Користувач повинен зареєструватися на сайті. Для цього він
                повинен натиснути кнопку «Вхід» та заповнити реєстраційну форму.
                Адміністратор залишає за собою право відхилити будь-яку заявку
                про реєстрацію та/або припинити будь-чию реєстрацію на Сайті.
            </p>
            {/* <p>
                2.2. Також Користувач може здійснити Замовлення товару без
                відповідної реєстрації, але при цьому ним повинні бути коректно
                заповнені обов'язкові поля у формі «Оформлення замовлення».
            </p> */}
            <p>
                2.2. Під час реєстрації на Сайті, а саме заповнення
                реєстраційної форми та створення Особистого кабінету, Користувач
                зобов&apos;язується вказувати інформацію, позначену як
                обов&apos;язкова, в повному обсязі, а також Користувач несе
                відповідальність за достовірність, правильність і правдивість як
                обов&apos;язкової, так і іншої наданої інформації. У разі
                виявлення будь-якої недостовірності, неправильності або
                неправдивості інформації, наданої Зареєстрованим Користувачем,
                Адміністрація Сайту безумовно залишає за собою право в будь-який
                момент анулювати Обліковий запис такого Зареєстрованого
                Користувача без будь-яких компенсацій чи відшкодувань.
            </p>
            <p>
                2.3. Внесення інформації у реєстраційну форму Сайту, а також
                оформивши Замовлення, Покупець підтверджує, що ознайомлений з
                умовами даної Угоди, і всі дії, які їм будуть здійснені, не
                будуть суперечити умовам цієї Угоди.
            </p>
            <p>
                2.4. Замовлення вважається прийнятим до виконання, а Угода між
                Покупцем і Продавцем — укладеною, після отримання Покупцем
                електронного повідомлення на адресу електронної пошти від
                Продавця або шляхом здійснення телефонного дзвінка Продавцем на
                номер мобільного телефону, що вказані при реєстрації Покупцем, з
                підтвердженням факту узгодження та приймання Замовлення.
            </p>
            <p>
                2.5. У випадку відсутності можливості підтвердження Замовлення
                Продавцем у Покупця, з причин невірно вказаної адреси
                електронної пошти чи\та номеру телефону, Продавець має право
                відмінити таке не підтверджене Замовлення.
            </p>
            <br />
            <p className="font-bold">Вартість та умови оплати товарів</p>
            <p>
                3.1. Ціна товару вказана на Сайті у відповідному розділі на
                момент оформлення Замовлення.
            </p>
            <p>
                3.2. Продавець має право в односторонньому порядку без
                попередження змінити ціну на товар. Однак Продавець не має права
                змінювати ціну замовленого товару після того, як Замовлення було
                прийнято Продавцем, а Покупець отримав електронне повідомлення
                або телефонний дзвінок, що підтверджує Замовлення або Покупець
                здійснив розрахунок за товар.
            </p>
            <p>
                3.3. Вартість товару сплачується в національній валюті України –
                гривні.
            </p>
            <p>
                3.4. Покупець може здійснити оплату замовленого Товару
                банківською картою Visa або MasterCard через платіжну систему
                LiqPay на Сайті в момент оформлення Замовлення
            </p>
            <p>
                3.5. Користувач/Покупець розуміє і погоджується з тим, що
                оператором з прийому і проведення платежів за товари,
                представлені на Сайті, є, залежно від обставин, одна з
                компаній-екваєрів, підключена до Сайту і обрана самостійно
                Користувачем/Покупцем у процесі здійснення оплати за товар.
            </p>
            <p>
                3.6. Товар до моменту його передачі Продавцем, повинен бути
                повністю оплачений Покупцем.
            </p>
            <p> 3.7. Умови оплати Контенту</p>
            <p>
                3.7.1. Отримання доступу до перегляду каталогу Контенту,
                розміщеного на www.bookme.kyiv.ua у відповідному розділі, є
                безплатним для Користувачів Сайту, а плата стягується за
                отримання доступу до завантаження обраних файлів Контенту у
                представлених на сайті форматах.
            </p>
            <p>
                3.7.2. Оплата за платний Контент здійснюється банківською картою
                Visa або MasterCard на Сайті в момент оформлення Замовлення.
            </p>
            <p>
                3.7.3. У випадку здійснення Покупцем оплати за надання доступу
                до завантаження Контенту та неможливості його безпосередньо
                завантажити з технічних чи будь-яких інших причин Покупцем (що
                виникли на стороні та з вини Покупця), повернення сплачених
                грошових коштів не проводиться, а Контент буде вважатися таким,
                що отриманий належним чином. Повернення сплачених грошових
                коштів можливе лише у тому випадку, якщо Продавцем був наданий
                неробочий файл (який неможливо відтворити чи зберегти (якщо це
                доведено після перевірки Продавцем) та у разі, якщо Продавець не
                може здійснити заміну такого файлу. Таким чином, Контент
                належної якості поверненню та обміну не підлягає.
            </p>
            <p>
                3.7.4. Ціна на Контент може змінюватися незалежно від того чи
                був він акційним чи ні. Продавець не компенсує Покупцю вартість
                придбаного Контенту в разі, якщо з часом цей Контент стає
                акційним та його вартість суттєво знижується. Покупець Контенту
                розуміє та погоджується, що після закінчення певного періоду
                ціна акційного Контенту може змінюватися, а безплатним акційний
                Контент може стати платним і навпаки.
            </p>
            <p>
                3.7.5. Ціни на Контент можуть змінюватись без попередження
                Покупця Контенту. Якщо зниження ціни відбувається після
                придбання Покупцем Контенту, Адміністрація Сайту не
                зобов&apos;язана здійснювати будь-які компенсації такому Покупцю
                Контенту.
            </p>
            <p>
                3.8. При анулюванні Замовлення чи проведенні повернення товару
                грошові кошти підлягають поверненню Покупцю, з урахуванням умов
                п. 3.6. цієї Угоди.
            </p>
            {/* <p>
                3.9. При поверненні товару грошові кошти підлягають поверненню
                Покупцю тільки після отримання товару та обробки Продавцем
                належним чином заповненої заяви на повернення.
            </p> */}
            {/* <p>
                3.10. Повернення грошових коштів може відбуватися одним з
                вказаних нижче способів: на банківську карту, з якої була
                проведена оплата Покупцем; шляхом здійснення поштового переказу.
                Замовлення оплачене повністю або частково за допомогою Бонусного
                рахунку — на Бонусний рахунок не повертаються.
            </p> */}
            {/* <p>
                3.12. Термін повернення грошових коштів – до 30 (тридцяти)
                робочих днів.
            </p> */}
            {/* <p>
                3.13. Додаткові правила та умови повернення грошових коштів
                викладені у відповідних розділах Сайту.
            </p> */}
            {/* <p>
                3.9. Продавець має право за придбання товару на Сайті
                нарахувати бонуси Покупцю. У випадку анулювання Покупцем
                Замовлення, повернення Покупцем Замовлення тощо, Продавець має
                право запропонувати Покупцю замість повернення сплачених
                грошових коштів нарахувати на Бонусний рахунок Покупця
                відповідну кількість бонусів (у розмірі сплачених Покупцем
                грошових коштів). Порядок нарахування, використання, припинення
                дії бонусів та використання Бонусного рахунку, інформація про
                Бонусну програму Bookme розміщено у відповідних розділах Сайту.
            </p> */}
            <p>
                3.9. Продавець може обмежувати можливість використання деяких зі
                способів здійснення оплати замовленого Товару (п. 3.4.).
            </p>
            <br />
            <p className="font-bold">Порядок передачі товару</p>
            <p>
                4.1. Доступ до скачування Контенту Покупцю надається одразу
                після оплати такого Контенту, Контент зберігається у Особистому
                кабінеті Покупця у відповідному розділі без обмеження у часі.
                Таким чином з моменту появи можливості скачати Контент та появи
                його в Особистому кабінеті вважається, що Продавцем було надано
                доступ до Контенту в повному обсязі.
            </p>
            {/* 4.10. Покупець має право призначити Одержувачем придбаного товару
            третю особу. У цьому випадку Покупець зобов'язаний вказати в формі
            Замовлення дані, необхідні для ідентифікації Одержувача і доставки
            йому товару. На відносини сторін, в такому випадку, поширюються
            положення ст. 636 Цивільного кодексу України.  */}
            <p>4.2. Надання доступу до завантаження Контенту.</p>{' '}
            <p>
                4.2.1. Надання доступу до завантаження Контенту надається тільки
                після повної оплати такого Контенту Покупцем.
            </p>
            <p>
                4.2.2. Кількість завантажень файлів Контенту, що придбані
                Покупцем від окремих Правовласників (безпосередніх власників
                контенту) може бути обмежена. Інформація про обмеження кількості
                завантажень Контенту може бути надана додатково. У разі
                перевищення допустимої кількості завантажень Покупцем Контенту
                доступ до придбаного файлу Контенту буде припинено. Якщо
                перевищення допустимої кількості завантажень відбулося з
                технічних причин (наприклад, через нестабільне з&apos;єднання
                або проблеми з програмним забезпеченням зі сторони Покупця
                Контенту), Адміністрація сайту залишає за собою право, але не
                зобов&apos;язана, надати такому Покупцю контенту можливість
                здійснити одне додаткове завантаження.
            </p>
            <p>
                4.2.3. Файли Контенту надаються для завантаження Покупцям
                Контенту у тому вигляді у якому були отримані від
                правовласників. Продавець зобов&apos;язується надати доступ до
                Контенту в одному або декількох із можливих варіантів форматів
                файлів Контенту на свій вибір. Продавець не несе
                відповідальності за неможливість завантаження файлу Контенту у
                певному форматі незалежно від того, чи був заявлений цей формат
                у списку доступних для цього твору.
                Продавець/Правовласник/Власник прав інтелектуальної власності не
                несе відповідальності за зміст Контенту.
            </p>
            <p>
                4.2.4. В окремих випадках на вимогу Правовласника Адміністрація
                залишає за собою право видалити з Особистого кабінету Покупця
                певний Контент або здійснити заміщення Контенту.
            </p>
            <br />
            <p className="font-bold"> Гарантійні умови</p>
            <p>5.1. Контент гарантійного терміну не має.</p>
            <br />
            <p className="font-bold">Повернення товару </p>6.1. Не підлягають
            поверненню товари належної якості, визначені Постановою Кабінету
            Міністрів України «Про реалізацію окремих положень Закону України
            «Про захист прав споживачів» від 19.03.1994 р № 172. 6.2. Не
            підлягає поверненню Контент після його оплати на Сайті Покупцем.
            <br />
            <p className="font-bold"> Доступ до Сайту</p>
            <p>
                7.1. Адміністрація докладає всіх можливих зусиль для
                забезпечення належного функціонування Сайту, проте не несе
                відповідальності за невиконання або неналежне виконання
                зобов&apos;язань передбачених цією Угодою, а також за шкоду,
                завдану у зв&apos;язку з цим, внаслідок, але не обмежуючись:
                неправомірними діями третіх осіб; збоями в роботі Сайту,
                зумовленими помилками в коді, комп&apos;ютерними вірусами та
                іншими сторонніми фрагментами коду в програмному забезпеченні
                Сайту; відсутністю інтернет-з&apos;єднань між пристроєм
                Користувача і сервером Сайту, а також між сервером Сайту і
                мережею Інтернет; проведенням державними органами та іншими
                належним чином уповноваженими організаціями оперативних заходів,
                що впливають на роботу Сайту; виконанням оновлень програмного
                забезпечення Сайту; за застосовним і таким, що набув чинності,
                рішенням уповноважених органів державної влади.
            </p>
            <p>
                7.2. З метою недопущення неавторизованого автоматичного
                сканування Сайту, а також використання Сайту з метою проведення
                шахрайських дій та у разі наявності обґрунтованої підозри у
                зловживаннях з боку Користувача, щодо використання Сайту (в тому
                числі порушення прав інтелектуальної власності Адміністрації та
                третіх осіб на Контент) Адміністрація залишає за собою право:
                заблокувати доступ до Сайту; скасувати всі покупки, здійснені
                шляхом використання неавторизованого доступу; стягнути
                відшкодування збитків, завданих використанням неавторизованого
                доступу до Сайту; заблокувати користування Бонусним рахунком.
            </p>
            <p>
                7.3. Обліковий запис на Сайті передбачає можливість його
                використання виключно одним Користувачем Сайту. Не допускається
                передача даних Облікового запису третім особам. У разі виявлення
                фактів передачі даних Облікового запису третім особам або фактів
                колективного користування Обліковим записом, Адміністрація має
                право заблокувати цей Обліковий запис і скасувати покупки,
                зроблені за допомогою такого Облікового запису.
            </p>
            <br />
            <p className="font-bold">Форс – мажорні обставини</p>
            <p>
                {' '}
                8.1. Сторони звільняються від відповідальності за повне або
                часткове невиконання своїх зобов’язань за цією Офертою, якщо
                таке невиконання стало наслідком обставин непереборної сили, що
                виникли після укладання даної Оферти та які Сторони не могли ані
                передбачити, ані попередити розумними заходами.
            </p>
            <p>
                {' '}
                8.2. Форс-мажорними обставинами (обставинами непереборної сили)
                є надзвичайні та невідворотні обставини, що об’єктивно
                унеможливлюють виконання зобов’язань, передбачених умовами
                договору (контракту, угоди тощо), обов’язків згідно із
                законодавчими та іншими нормативними актами, а саме: загроза
                війни, збройний конфлікт або серйозна погроза такого конфлікту,
                включаючи але не обмежуючись ворожими атаками, блокадами,
                військовим ембарго, дії іноземного ворога, загальна військова
                мобілізація, військові дії, оголошена та неоголошена війна, дії
                суспільного ворога, збурення, акти тероризму, диверсії,
                піратства, безлади, вторгнення, блокада, революція, заколот,
                повстання, масові заворушення, введення комендантської години,
                карантину, встановленого Кабінетом Міністрів України,
                експропріація, примусове вилучення, захоплення підприємств,
                реквізиція, громадська демонстрація, блокада, страйк, аварія,
                протиправні дії третіх осіб, пожежа, вибух, тривалі перерви в
                роботі транспорту, регламентовані умовами відповідних рішень та
                актами державних органів влади, закриття морських проток,
                ембарго, заборона (обмеження) експорту/імпорту тощо, а також
                викликані винятковими погодними умовами і стихійним лихом, а
                саме: епідемія, сильний шторм, циклон, ураган, торнадо, буревій,
                повінь, нагромадження снігу, ожеледь, град, заморозки,
                замерзання моря, проток, портів, перевалів, землетрус,
                блискавка, пожежа, посуха, просідання і зсув ґрунту, інші
                стихійні лиха тощо.
            </p>
            <p>
                8.3. Наявність та строк дії Форс-мажорних обставин
                підтверджується сертифікатом Торгово-промислової палати України
                встановленого зразка, наказами Президента України, наказами
                Кабінету Міністрів України, тощо.
            </p>
            <p>
                8.4. Покупець погоджується з тим, що в разі якщо Продавець в
                зв’язку з настанням Форс-мажорних обставин не зміг виконати
                замовлення Покупця то в даному випадку грошові кошти сплачені за
                товар Покупцю не повертаються, при цьому замість цього Продавець
                нараховує на Бонусний рахунок Покупця відповідну кількість
                бонусів (у розмірі сплачених Покупцем грошових коштів).
            </p>
            <br />
            <p className="font-bold"> Відповідальність Сторін</p>{' '}
            <p>
                9.1. Покупець/Користувач Сайту, погоджується та гарантує не
                робити будь-яких дій, які можуть розглядатися як порушують
                українське законодавство або норми міжнародного права, в тому
                числі в сфері інтелектуальної власності, авторських і/або
                суміжних правах, а також будь-яких дій, які призводять або
                можуть призвести до порушення нормального функціонування Сайту і
                його сервісів.
            </p>
            <p>
                9.2. Покупець/Користувач зобов&apos;язаний своєчасно
                проінформувати Адміністрацію Сайту про несанкціонований доступ
                до Особистого кабінету Користувача/Покупця третіми особами. Для
                інформування Покупець/Користувач повинен звернутися в Службу
                підтримки за координатами, вказаними на Сайті.
            </p>
            <p>
                9.3. Користувач не має права передавати право користування
                власним Особистим кабінетом третім особам. У разі виявлення
                фактів передачі даних Облікового запису третім особам або фактів
                колективного користування Особистим кабінетом Адміністрація має
                право заблокувати цей Обліковий запис і скасувати покупки,
                зроблені за допомогою такого Облікового запису.
            </p>
            <p>
                9.4. Користувачу/Покупцю заборонено пропонувати або
                використовувати інформацію, розміщену на Сайті (в тому числі
                Контент), з комерційною метою без письмової згоди її
                авторів/правовласників і Адміністрації Сайту, а також будь-яким
                іншим чином поширювати отриманий Контент, його копії.
            </p>
            <p>
                9.5. Приймаючи умови Угоди Користувач/Покупець підтверджує, що
                ознайомлений і згоден із умовами цієї Угоди.
            </p>
            <p>
                9.6. Коментарі та інші записи Користувача/Покупця на Сайті не
                повинні суперечити вимогам законодавства України та
                загальноприйнятих норм моралі та моральності.
            </p>
            <p>
                9.7. Використання матеріалів Сайту без письмової згоди
                Адміністрації не допускається. При погодженому цитуванні
                матеріалів Сайту, посилання на Сайт є обов&apos;язковим.
            </p>
            <p>
                9.8. Користувач/Покупець несе відповідальність за достовірність
                даних, зазначених у реєстраційній формі та формі Замовлення. У
                разі, якщо некоректне, неточне і/або неправильне зазначення
                даних в Замовленні призвело до додаткових витрат Продавця,
                пов&apos;язаних з видачею товару невірно вказаному Одержувачу,
                всі пов&apos;язані з цим збитки та витрати покладаються на
                Користувача/Покупця. Продавець має право утримувати суму таких
                збитків або витрат з сум, сплачених Покупцем в якості оплати
                товару.
            </p>
            <p>
                9.9. Відповідальність за грошові перекази, які здійснює Платник,
                повністю лежить на банківських установах і платіжних системах,
                послугами яких вирішує скористатися Платник. Продавець не бере
                на себе відповідальність за їх дії.
            </p>
            <p>
                9.10. Адміністратор не несе відповідальності за роботу інтернет
                провайдерів, процесингових центрів, платіжних систем, операторів
                зв&apos;язку, банківських установ, сервісів оплати
                Visa/MasterCard, в результаті яких необхідна інформація, дані не
                надійшли або надійшли із запізненням, були загублені або
                пошкоджені. Будь-які претензії і суперечки щодо проведення
                платежів і отримання грошових повернень Платник надсилає такій
                самостійно обраній компанії, а в разі неможливості їх вирішення
                мирним шляхом вони вирішуються згідно з положеннями Розділу 8
                цієї Угоди.
            </p>
            <p>
                9.11. Єдиним засобом відшкодування, яке надається Покупцеві в
                разі невідповідності фактичних умов продажу цій Угоді, є надання
                Покупцеві/Одержувачу права відмовитися від отримання
                відповідного товару та вимагати повернення сплаченої за нього
                вартості. Покупець/Одержувач має право скористатися даним правом
                до моменту підписання документів, що підтверджують отримання
                товару.
            </p>
            <p>
                9.12. Адміністратор сайту не несе відповідальність за
                працездатність обладнання, на якому розміщений Сайт, доступність
                Сайту, роботу каналів передачі даних та інші технічні засоби для
                здійснення Користувачами доступу до Сайту.
            </p>
            <p>
                9.13. Відповідальність Адміністратора не може перевищувати
                вартості придбаних товарів на Сайті та не включає будь-яку
                упущену вигоду, непрямі збитки, шкоду завдану третім особам.
            </p>
            <p>
                9.14. Продавець не несе відповідальність за дії компаній, що
                забезпечують доставку товару Одержувачу/Покупцю, в тому числі за
                терміни доставки.
            </p>
            <p>
                9.15. Відповідальність Продавця за зміни умов пропонування до
                продажу та продажу товару обмежується правом
                Користувача/Одержувача/Покупця відмовитися від придбання товару
                і вимагати повернення сплачених за нього грошових коштів.
            </p>
            <br />
            <p className="font-bold">Вирішення суперечок і застосовне право</p>
            <p>
                10.1. Ця Угода складена відповідно до законодавства України.
                Користувач/Покупець, який перебуває за межами цієї юрисдикції,
                повністю погоджується підпорядкувати правовідносини, що
                виникають під час будь-якого користування Сайтом, законодавству
                України, а ці Умови діють щодо нього в максимальному дозволеному
                його юрисдикцією обсязі без застосування будь-яких колізійних
                норм.
            </p>
            <p>
                10.2. Сторони підтверджують, що в разі якщо будь-яка умова цього
                договору стане або буде визнана недійсною у зв&apos;язку з
                невідповідністю закону, ця умова не братиметься до уваги або ж
                Сторонами будуть вживати заходи зі зміни договору в тій мірі,
                щоб зробити договір дійсним і зберегти в повному обсязі наміри
                Сторін.
            </p>
            <p>
                10.3. Користувач/Покупець визнає і погоджується, що вирішення
                всіх можливих суперечок, які виникли з відносин між Сторонами і
                залагодити які Сторони не змогли шляхом переговорів протягом як
                мінімум 30 днів, підлягають вирішенню відповідно до чинного
                законодавства України.
            </p>
            <p>
                10.4. Будь-які претензії та суперечки щодо надання доступу до
                завантаження Контенту Покупець/Користувач надсилає до
                Адміністрації, а в разі неможливості їх вирішення мирним шляхом
                вони вирішуються згідно законодавства України.
            </p>
            <br />
            <p className="font-bold">
                Використання персональних даних Користувача
            </p>
            <p>
                11.1. Інформація, вказана Користувачем у реєстраційній формі
                (ПІБ, номер мобільного телефону, e-mail, поштова адреса і т.п.),
                є його персональними даними. Персональні дані Користувача є
                конфіденційною інформацією, збір і подальша обробка персональних
                даних здійснюється Адміністрацією відповідно до Закону України
                «Про захист персональних даних» та інших нормативно-правових
                актів України. Джерелом збору персональних даних є інформація,
                безпосередньо і добровільно надана Користувачем.
            </p>
            <p>
                11.2. Метою Обробки персональних даних є забезпечення
                Адміністрацією можливості ідентифікації Користувача власної
                інформації на Сайті, забезпечення можливості Адміністрації
                надавати необхідні для продажу Товару і Контенту, послуги на
                Сайті, забезпечення можливості Користувача на отримання
                технічної та консультативної підтримки щодо використання Сайту,
                а також забезпечення Адміністрацією надання послуг та виконання
                своїх зобов’язань відповідно до умов цієї Угоди.
            </p>
            <p>
                11.3. Своєю згодою з цією Угодою Користувач добровільно надає
                Адміністрації зазначені в реєстраційній формі персональні дані
                для реєстрації в інформаційній системі в якості Користувача, а
                також з метою підтримки довгострокового співробітництва з
                Адміністрацією Сайту. Користувач також дає безстрокову згоду на
                використання його персональних даних для обробки Замовлень на
                придбання товарів, отримання рекламних та спеціальних
                пропозицій, інформації про акції, розіграші, іншої інформації
                про діяльність Адміністрації.
            </p>
            <p>
                11.4. Користувач надає Адміністрації право здійснювати обробку
                його персональних даних, в тому числі: записувати персональні
                дані в бази даних Адміністрації (без додаткового повідомлення
                Користувача про це), здійснювати довічне зберігання даних, їх
                накопичення, оновлення, зміну (у разі необхідності).
            </p>
            <p>
                11.5. Власником наданих Користувачем персональних даних є ФОП
                Науменко Михайло Вікторович, який зареєстрований в Україні та
                офіс якої розташований за адресою: 02000, м. Київ, вул. Щусєва,
                23.
            </p>
            <p>
                11.6. У разі зміни своїх персональних даних Користувач повинен
                надати Адміністрації оновлену інформацію, звернувшись за
                телефоном Служби підтримки Адміністрації або шляхом внесення
                змін у відповідний розділ Облікового запису Користувача на
                Сайті. У разі невиконання Користувачем даної вимоги,
                Адміністрація не несе відповідальності за несприятливі наслідки,
                пов&apos;язані з використанням застарілих даних.
            </p>
            <p>
                11.7. Користувач/Покупець безпосередньо після реєстрації або в
                будь-який інший момент може встановити заборону (обмеження) на
                використання його персональних даних. Для цього Користувач
                повинен звернутися до Служби підтримки, за телефоном вказаним на
                Сайті, з відповідним повідомленням. Користувачу також надаються
                інші права, передбачені статтею 8 Закону України «Про захист
                персональних даних».
            </p>
            <p>
                11.8. Адміністрація не приймає реєстраційні данні Користувача у
                випадку їх некоректного заповнення.
            </p>
            <p>
                11.9. Адміністрація зобов&apos;язується вчасно інформувати
                Користувача про його можливості та винагороди, однак не несе
                відповідальності за повідомлення, які не були доставлені
                Користувачу в результаті незалежних від Адміністрації обставин.
            </p>
            <p>
                11.10. Для цілей, передбачених п. 10.2. цієї Угоди, Користувач
                надає Адміністрації право направляти йому будь-яку інформацію
                комерційного і / або інформаційного характеру, а також
                інформацію про інші споживчі пропозиції поштою, електронною
                поштою, телефоном, SMS, здійснювати дзвінки на вказаний в
                реєстраційній формі/Обліковому записі телефонний мобільний
                номер.
            </p>
            <p>
                11.11. Дані Користувача, зазначені у реєстраційних даних є
                конфіденційними. Доступ до даних мають виключно уповноважені
                особи Адміністрації і сам Користувач, а також ці дані можуть
                бути надані на вимогу правоохоронних та/або інших органів
                відповідно до чинного законодавства.
            </p>
            <p>
                11.12. Відповідальність за недостовірність даних у Обліковому
                записі несе Користувач.
            </p>
            <p>
                11.13. Адміністрація має право надати дозвіл на обробку
                персональних даних третім особам (в тому числі Продавцю) за
                умови дотримання такою третьою особою правил та умов цієї Угоди.
            </p>
            <p>
                11.14. Реалізація прав Користувача як суб&apos;єкта персональних
                даних, передбачених Законом України «Про захист персональних
                даних» можлива шляхом надсилання Користувачем Адміністрації
                відповідного звернення за реквізитами Адміністрації вказаними в
                п. 10.5. цієї Угоди.
            </p>
            <br />
            <p className="font-bold">Інші умови</p>
            <p>
                12.1. Всі правила і умови здійснення/виконання окремих
                дій/операцій, розміщені у відповідних розділах Сайту, є
                невід&apos;ємними частинами (як Додатки) даної Угоди, що
                визначають зобов&apos;язання для обох Сторін. У разі якщо умови,
                зафіксовані в тексті цієї Угоди, і умови, зазначені в його
                Додатках (розділах сайту), відрізняються, Сторони керуються
                умовами, визначеними в Додатках. Продаж товару Продавцем Покупцю
                регулюється цим Договором, а також Законом України «Про
                електронну комерцію», Законом України «Про захист прав
                споживачів», Правилами продажу товарів на замовлення та поза
                торговельними або офісними приміщеннями та іншими законодавчими
                актами в частині, що не суперечить специфіці електронної
                комерції.
            </p>
            <p>
                12.2. Оформляючи Замовлення Покупець підтверджує, що: він
                ознайомлений та згоден з усіма умовами, викладеними в даній
                Публічної оферти, і беззастережно їх приймає; всі дії, які їм
                будуть здійснені, не суперечитимуть умовам даної Угоди.
            </p>
            <p>
                12.3. Адміністрація має право без попереднього повідомлення
                вносити зміни в текст даної Угоди і/або Додатків. Зміни в
                Публічну оферту вступають в силу після їх публікації і
                застосовуються до будь-якого Замовленню, зробленому після їх
                публікації.
            </p>
            <p>
                12.4. Користувач зобов&apos;язується уважно ознайомитися з даною
                Угодою. У разі незгоди з його умовами Користувач
                зобов&apos;язується негайно припинити використання Сайту
            </p>
            <p>
                12.5. Продавець і Покупець підтримують зв&apos;язок за допомогою
                використання електронної пошти, телефонного зв&apos;язку (SMS і
                т.д), додатків, оголошень і/або повідомлень. Покупець
                погоджується, що всі повідомлення, дані або інша інформація, що
                надається в електронному вигляді, мають юридичну силу і
                прирівнюються до документів, складених в письмовій формі з
                урахуванням положень п. 1.5. цієї Угоди.
            </p>
            <p>
                12.6. Зареєструвавшись на Сайті, Покупець надає свою згоду на
                отримання оновленої інформації, інформаційних бюлетенів з
                останніми новинами, новими надходженнями, спеціальними
                пропозиціями та оголошеннями про продаж через будь-які засоби
                зв&apos;язку, включаючи електронні повідомлення (e-mail), SMS
                тощо.
            </p>
            <p>
                12.7. Якщо Покупець бажає відмовитися від розсилки повідомлень,
                що стосуються цієї Угоди/Сайту, він повинен звернутися у Службу
                підтримки зателефонувавши або направивши електронного листа на
                електронну пошту, що вказана на Сайті, з проханням відписати
                його від розсилки. Запит буде виконаний протягом доби з моменту
                його надходження.
            </p>
            <p>
                12.8. Адміністрація залишає за собою право блокувати Покупця
                (позбавити його можливості замовляти і купувати товари),
                звертатися з відповідними заявами в правоохоронні органи і
                передавати їм дані такого Покупця в разі, якщо будь-які дії
                Покупця, на думку Продавця, носять ознаки шахрайства та можуть
                завдати шкоди інтересам інших Користувачів/Покупців чи третіх
                осіб.
            </p>
            <p>
                12.9. Визнання судом будь-якого положення Угоди недійсним, не
                тягне недійсності інших положень Угоди.
            </p>
        </Wrapper>
    );
};

export default ConditionsOfUse;
